testCases/CBFS_Reb13700/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       71620;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       71800;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       71980;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       72180;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          72000;
        startFace       72380;
    }
)

// ************************************************************************* //
