testCases/CBFS_Reb13700/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "424";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
36000
(
(0.14376279595658 2.41791716192478e-06 0)
(0.141683823895235 0.000116993228825936 -2.65679628309574e-22)
(0.137110182061806 9.2335641831402e-05 2.6880719576139e-22)
(0.132960312405999 3.83959335543936e-05 0)
(0.130230913807004 7.63222326995722e-06 -5.59341445039139e-22)
(0.128509275478524 -3.45336805198603e-06 5.62178194034214e-22)
(0.12736274773217 -8.08055128010813e-06 0)
(0.12661338219692 -1.12847004372229e-05 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
200
(
(0.142958870148 0 0)
(0.376235650743 0 0)
(0.502806826054 0 0)
(0.571120157421 0 0)
(0.613286557642 0 0)
(0.642360293888 0 0)
(0.663922450756 0 0)
(0.681170438839 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
