testCases/CBFS_Reb13700/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "424";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
36000
(
3.11190896858738e-06
3.02338537923825e-06
2.85614761634874e-06
2.70733218687618e-06
2.61102242334155e-06
2.5532125053937e-06
2.51789336084291e-06
2.49755834188077e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            nutLowReWallFunction;
        blending        stepwise;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    topWall
    {
        type            nutLowReWallFunction;
        blending        stepwise;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
3.09102182354194e-06
3.21584581287136e-05
0.000111431545894201
0.000211611181376288
0.000329936560134637
0.000469837325134708
0.000630785059180282
0.000809910320569834
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
3.47542669576402e-06
4.81997052499413e-05
0.000192927506955467
0.000401144213524065
0.000669320495660767
0.000987985458011164
0.0013455688807879
0.00173094759505498
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
