testCases/CBFS_Reb13700/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "424";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
36000
(
226.06270710873
226.028731987023
225.964560435308
225.907473044701
225.870535112103
225.848366013088
225.834822801494
225.827025656467
...
)
;

boundaryField
{
    bottomWall
    {
        blending        binomial;
        n               2;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
180
(
226.06270710873
226.028731987023
225.964560435308
225.907473044701
225.870535112103
225.848366013088
225.834822801494
225.827025656467
...
)
;
    }
    topWall
    {
        blending        binomial;
        n               2;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
180
(
187.77917973598
184.341724107926
182.057380249397
180.999524507098
180.608683853525
180.472540959096
180.414518084134
180.383372407614
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
200
(
226.052908951203
59.2164935826159
28.3384808642229
16.3453611225847
10.7045720039066
7.66150945177079
5.85936705190836
4.71335169418102
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
